export enum ShippingType {
   SameDayDelivery = 'توصيل_في_نفس_اليوم',
   FastDelivery = 'توصيل_سريع',
   RegularDelivery = 'توصيل_عادي'
 }
 
 export enum PaymentType {
   PayOnDelivery = 'واجبة_التحصيل',
   Prepaid = 'دفع_مقدم',
   ExchangePackage = 'طرد_مقابل_طرد'
 }
 
 export enum OrderType {
   BranchPickup = 'تسليم_فالفرع',
   HomeDelivery = 'توصيل_الي_المنزل'
 }
 
 export enum OrderStatus {
  جديد = 'جديد',
  قيد_الانتظار = 'قيد الانتظار',
  تم_التسليم_للمندوب = 'تم التسليم للمندوب',
  تم_التسليم = 'تم التسليم',
  لا_يمكن_الوصول = 'لا يمكن الوصول',
  تم_التاجيل = 'تم التأجيل',
  تم_التسليم_جزئيا = 'تم التسليم جزئيا',
  تم_الالغاء_من_جهة_العميل = 'تم الإلغاء من جهة العميل',
  تم_الرفض_مع_الدفع = 'تم الرفض مع الدفع',
  رفض_مع_سداد_جزء = 'رفض مع سداد جزء',
  رفض_ولم_يتم_الدفع = 'رفض ولم يتم الدفع',
}
